app/controllers/madlibs_controller.rb

  def index
  	@madlibs = Madlib.all
---
SELECT "madlibs".* FROM "madlibs"

  def show
    @madlib = Madlib.find(params[:id])
---
SELECT "madlibs".* FROM "madlibs" WHERE "madlibs"."id" = ? LIMIT 1  [["id", "index"]]